package Project_Magic_World.Magic_World_5;

public enum EnumeratorSurnames {
    азартный, активный, безбожный, бездушный, безжалостный, безумный, 
    беспощадный, бесстыдный, богатый, великий, возмутительный, всесильный,
    высокий, головокружительный, грандиозный, дремучий, жесточайший,
    жуткий, закадычный, заядлый, злой, идеальный, исключительный, 
    катастрофический, матерый, невообразимый, ослепительный, отчаянный, 
    радикальный, раздирающий, сатанинский, триумфальный, умопомрачительный,
    феноменальный, чудовищный

}